In [1]:
import pandas as pd
ufo = pd.read_csv('http://bit.ly/uforeports')
ufo.shape

(18241, 5)

In [2]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [3]:
ufo.drop('City', axis = 1).head()
# 注意：drop方法中inplace参数默认取值是False

  Colors Reported Shape Reported State             Time
0             NaN       TRIANGLE    NY   6/1/1930 22:00
1             NaN          OTHER    NJ  6/30/1930 20:00
2             NaN           OVAL    CO  2/15/1931 14:00
3             NaN           DISK    KS   6/1/1931 13:00
4             NaN          LIGHT    NY  4/18/1933 19:00

In [4]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [5]:
ufo.drop('City', axis = 1, inplace = True)
# 当inplace参数设置为True时，City列才真正删除了

In [6]:
ufo.head()

  Colors Reported Shape Reported State             Time
0             NaN       TRIANGLE    NY   6/1/1930 22:00
1             NaN          OTHER    NJ  6/30/1930 20:00
2             NaN           OVAL    CO  2/15/1931 14:00
3             NaN           DISK    KS   6/1/1931 13:00
4             NaN          LIGHT    NY  4/18/1933 19:00

In [9]:
ufo.dropna(how = 'any').shape
# inplace参数默认取值为False是有道理的，为了避免不小心删除数据
# 通常我们并不会经常删除样本，我们只是想看一下结果而已

(2490, 4)

In [10]:
ufo.shape

(18241, 4)

In [11]:
ufo.fillna(method = 'bfill').tail()

      Colors Reported Shape Reported State              Time
18236             RED       TRIANGLE    IL  12/31/2000 23:00
18237             RED           DISK    IA  12/31/2000 23:00
18238             RED          LIGHT    WI  12/31/2000 23:45
18239             RED          LIGHT    WI  12/31/2000 23:45
18240             NaN           OVAL    FL  12/31/2000 23:59

In [ ]:
ufo.